exercise_app_api/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "calories", "time", "weight", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "test"], ["calories", 2], ["time", 3], ["weight", 209], ["created_at", "2020-07-11 02:50:59.954221"], ["updated_at", "2020-07-11 02:50:59.954221"]]